app/controllers/opportunities_controller.rb

SELECT "opportunities".* FROM "opportunities"
SELECT "categories".* FROM "categories"
---
  def index
    @opportunities = Opportunity.all
    @categories = Category.all

INSERT INTO "opportunities" ("name", "location", "contact", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @opportunity = Opportunity.new(opportunity_params)

    respond_to do |format|
      if @opportunity.save

SELECT  "opportunities".* FROM "opportunities" WHERE "opportunities"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_opportunity
      @opportunity = Opportunity.find(params[:id])