app/views/categories/show.html.erb

<ul>
	<li><% @category.opportunities.each do |opportunity| %></li>
---
SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."category_id" = ?  [["category_id", 1]]